// ****************************************
// СОЗДАНИЕ ПРОЭКТА C#  (в консоли)

dotnet new list  // - получить список типов проэктов которые можно создать
dotnet new /*тип проэкта*/



// ****************************************
// БАЗА
using System;  // - добавляет пространство имен и делает код чище (надо добавлять)

Console.WriteLine('text');
Console.Write('text');      // - отличие в том, что не создается новая строка для вывода и всё выводится в той же строке



// ****************************************
// ПЕРЕМЕННЫЕ
var wwww = 0;       // универсальная переменная
string w = 'text';  // 
char www = 'w'      // только для одного символа (вообще любые символы)
int wwww = 123;     //
float ww = 1.23;    //